
为了应对线性代数的毕业补考.

时间为 2023 年 4 月 1 号.
现在时间为 2023 年 3 月 30 号, 还有两天时间.

最快学习方法是根据题库, 了解题型与解题方法. 同时观看袁题库.

*************************************************************************


初等变换是贯穿了矩阵和行列式和向量, 其中行列式和矩阵的初等变换规则不同. 

- [X] 初等变换

  矩阵和行列式计算大题的基础, 不管是矩阵求逆, 还是矩阵求 R,

  - [X] 解题技巧: 把小的放到 1 行, 然后 2, 3 行减去 1 行

  虽然时初等变换, 但是两者不同, 例如行列式可以把乘法剥离出去. 
  - [X] 矩阵的初等变换
    1. 原地 * k
    2. 置换
    3. 某行乘某行的倍数
    
  - [X] 行列式的初等变换
    1. K * |某行或某列 1/k |
    2. -1 |某行或某列置换|
    3. 某行 + 某行的倍数, 行列式不变


矩阵

- [X] 矩阵判断是否可逆
  - [X] 行列式 != 0
  - [X] 存在 AB = E

- [X] 矩阵求逆: 只有初等变换法

- [X] 矩阵求 R

  把最后一行变成 [0, 0, X] 的形式. 


行列式的求解
  
- [X] 行列式通过初等转换为下三角的形式

- [X] 行列式的行/列展开

- [X] 行列式泛的蒙公式


向量的线性有关的题目都是求秩 R

- [X] 向量的线性表示: 
  
  假设 a1=(),a2=(),a3=(),b=(), 判断 b 是否可由 a1,a2,a3, 线性表示.

  则使用 (a1,a2,a3) 和 (a1,a2,a3,b) 构建，看是否秩 R 相同.

- [X] 向量的线性有关还是无关

  若向量 a,b,c,d 构成 A, 判断 A 是否向量相关 ???

  则求出 A 的秩 R, 若 R < 向量个数, 则线性相关, 否则 R == 向量个数, 则线性无关.
  
- [X] 求极大无关组

  极大无关组, 已知 a1=(),a2=(),a3=(), 求向量 a1,a2,a3,a4 的极大无关组.

  1. 向量组合矩阵
  2. 求 R 
  3. 给编号, 然后根据求解过程中是否置换, 而交换编号.
  4. 根据 R 取前面几个编号, 例如 4,2,3, 则 a4,a2,a3 是极大无关组. 
  

解方程组

求非零解, 还是是否有解, 

- [ ] 

* DONE W: 题库: 矩阵求逆
  CLOSED: [2023-03-30 Thu 13:45] DEADLINE: <2023-03-30 Thu 09:30>
  - State "DONE"       from "STRT"    [2023-03-30 Thu 13:45]
  :LOGBOOK:
  CLOCK: [2023-03-30 Thu 08:19]--[2023-03-30 Thu 09:22] =>  1:03
  :END:
* DONE W: 题库: 矩阵求 R   
   CLOSED: [2023-03-30 Thu 13:45]
   - State "DONE"       from "STRT"    [2023-03-30 Thu 13:45]
  :LOGBOOK:
  CLOCK: [2023-03-30 Thu 11:09]--[2023-03-30 Thu 12:02] =>  0:53
  :END:
* DONE W: 题库: 矩阵的 Ax = B, 求 x 
   CLOSED: [2023-03-30 Thu 13:45]
   - State "DONE"       from "STRT"    [2023-03-30 Thu 13:45]
  :LOGBOOK:
  CLOCK: [2023-03-30 Thu 13:18]--[2023-03-30 Thu 13:45] =>  0:27
  :END:



* DONE 求 n 阶行列式
   CLOSED: [2023-03-30 Thu 15:30]
   - State "DONE"       from "STRT"    [2023-03-30 Thu 15:30]
   :LOGBOOK:
   CLOCK: [2023-03-30 Thu 14:13]--[2023-03-30 Thu 15:28] =>  1:15
   :END:

* DONE 求 N 阶行列式的方法之：泛的蒙行列式 
   CLOSED: [2023-03-30 Thu 16:33] DEADLINE: <2023-03-30 Thu 16:20>
   - State "DONE"       from "STRT"    [2023-03-30 Thu 16:33]
   :LOGBOOK:
   CLOCK: [2023-03-30 Thu 15:46]--[2023-03-30 Thu 16:32] =>  0:46
   CLOCK: [2023-03-30 Thu 15:36]--[2023-03-30 Thu 15:37] =>  0:01
   :END:



* STRT T: 第一套(矩阵)和第二套(行列式)题库测试
  :LOGBOOK:
  CLOCK: [2023-03-30 Thu 18:17]--[2023-03-30 Thu 20:55] =>  2:38
  :END:

- [ ] 
  


* DONE W: 题库: 初等转换求 n 阶行列式
  CLOSED: [2023-03-30 Thu 23:17]
  - State "DONE"       from "STRT"    [2023-03-30 Thu 23:17]
  :LOGBOOK:
  CLOCK: [2023-03-30 Thu 22:39]--[2023-03-30 Thu 23:17] =>  0:38
  :END:
* DONE W: 题库: 行列式的泛的蒙公式
  CLOSED: [2023-03-30 Thu 23:25]
  - State "DONE"       from "TODO"       [2023-03-30 Thu 23:25]
* DONE W: 题库: 行列式的行列展开
  CLOSED: [2023-03-31 Fri 07:52]
  - State "DONE"       from "STRT"    [2023-03-31 Fri 07:52]
  :LOGBOOK:
  CLOCK: [2023-03-31 Fri 07:31]--[2023-03-31 Fri 07:52] =>  0:21
  :END:
  

* STRT R: 猴辅导: 解方程组
  DEADLINE: <2023-03-31 Fri 14:00>
  :LOGBOOK:
  CLOCK: [2023-03-31 Fri 13:43]--[2023-03-31 Fri 14:31] =>  0:48
  :END:
